[
    {
        "title": "Best BBA College in Dehradun: Guru Nanak College",
        "author": "GNC",
        "date": "2024-09-05",
        "content": "<p>Dehradun, the capital city of Uttarakhand, is well-known for its serene beauty and excellent educational institutions. Among the top colleges in the region, Guru Nanak College (GNC) stands out as a premier choice for students pursuing a Bachelor of Business Administration (BBA). Here&rsquo;s an in-depth look at what makes Guru Nanak College the best BBA college in Dehradun. Comprehensive Curriculum Guru Nanak College offers a robust BBA program that spans three years, designed to provide students with a solid foundation in business principles. The curriculum encompasses a variety of subjects such as management, finance, marketing, human resources, and entrepreneurship. This diverse range of courses ensures that students gain a comprehensive understanding of the business world, preparing them for a wide array of career opportunities. Experienced Faculty The faculty at Guru Nanak College consists of experienced professionals and academicians who bring a wealth of knowledge to the classroom. Their practical insights and real-world experience enrich the learning process, enabling students to gain both theoretical knowledge and practical skills. The faculty members are dedicated to mentoring and guiding students, helping them to achieve their academic and professional goals. State-of-the-Art Infrastructure GNC boasts modern infrastructure that enhances the overall learning experience. The college campus is equipped with well-maintained classrooms, advanced computer labs, a comprehensive library, and comfortable study areas. These facilities provide a conducive environment for academic growth and personal development. Placement Support One of the standout features of Guru Nanak College is its strong placement support system. The college has established connections with leading companies and organizations, ensuring that students have access to excellent internship and job opportunities. The placement cell organizes regular workshops, training sessions, and career counseling to prepare students for the job market. Graduates from GNC have been successfully placed in reputed firms across various industries. Holistic Development At Guru Nanak College, education goes beyond academics. The college encourages students to participate in a wide range of extracurricular activities, including cultural events, sports, and community service. These activities play a crucial role in the holistic development of students, fostering essential skills such as teamwork, leadership, and communication. Student-Centric Approach GNC prides itself on its student-centric approach, offering personalized attention and support to each student. The college provides various scholarships and financial assistance programs to help students achieve their educational aspirations. Additionally, the faculty and administration are always accessible, ensuring that students have a supportive environment throughout their academic journey. Positive Student Feedback The positive feedback from students and alumni speaks volumes about the quality of education at Guru Nanak College. Many students have praised the college for its excellent faculty, supportive administration, and vibrant campus life. The strong sense of community and the emphasis on personal growth make GNC a preferred choice for aspiring business professionals.<\/p>",
        "image": ".\/admin\/uploads\/6755ec5374ddb.webp",
        "slug": "best-bba-college-in-dehradun-guru-nanak-college",
        "show_toc": false
    },
    {
        "title": "Best BCA College in Dehradun: Guru Nanak College",
        "author": "GNC",
        "date": "2024-09-03",
        "content": "Dehradun, known for its picturesque landscapes and educational institutions, is home to Guru Nanak College (GNC), which stands out as one of the best choices for pursuing a Bachelor of Computer Applications (BCA). Here’s why GNC is a top contender:\r\n\r\nComprehensive Curriculum\r\nGuru Nanak College offers a well-rounded BCA program that covers essential subjects such as programming, database management, information technology, and cyber security. The curriculum is designed to provide students with a strong foundation in computer applications and prepare them for various roles in the IT industry.\r\n\r\nExperienced Faculty\r\nThe faculty at GNC comprises seasoned professionals and academicians who bring real-world experience to the classroom. Their expertise and dedication ensure that students receive high-quality education and mentorship, helping them to excel in their studies and future careers.\r\n\r\nState-of-the-Art Infrastructure\r\nGNC boasts modern infrastructure, including well-equipped computer labs, a comprehensive library, and comfortable study areas. These facilities create an optimal learning environment, enabling students to focus on their academic pursuits.\r\n\r\nPlacement Support\r\nThe college has a robust placement cell that connects students with top companies in the IT sector. Regular workshops, training sessions, and career counseling are provided to help students develop the skills needed to succeed in the job market. GNC’s placement record is impressive, with many graduates securing positions in reputed organizations.\r\n\r\nHolistic Development\r\nGNC emphasizes holistic development by encouraging students to participate in extracurricular activities such as cultural events, sports, and community service. These activities help students develop essential life skills, including teamwork, leadership, and communication.\r\n\r\nStudent-Centric Approach\r\nThe college adopts a student-centric approach, offering personalized support and guidance to each student. Various scholarships and financial assistance programs are available to help students achieve their educational goals. The faculty and administration are always accessible, ensuring a supportive and nurturing environment.\r\n\r\nPositive Student Feedback\r\nStudents and alumni of GNC have consistently praised the college for its excellent faculty, supportive administration, and vibrant campus life. The strong sense of community and emphasis on personal growth make GNC a preferred choice for aspiring IT professionals.",
        "image": ".\/admin\/uploads\/6755ed20ebee8.webp"
    },
    {
        "title": "Best B.Sc in Biotechnology College in Dehradun: Guru Nanak College",
        "author": "GNC",
        "date": "2024-09-02",
        "content": "<p>Dehradun, known for its scenic beauty and educational excellence, is home to Guru Nanak College (GNC), which stands out as one of the top choices for pursuing a Bachelor of Science in Biotechnology (B.Sc. Biotechnology). Here’s why GNC is a leading contender:\r\n\r\nComprehensive Curriculum\r\nGuru Nanak College offers a well-rounded B.Sc. Biotechnology program that covers essential subjects such as molecular biology, genetics, bioinformatics, microbiology, and bioprocess engineering. The curriculum is designed to provide students with a strong foundation in biotechnology, preparing them for various roles in the biotech industry.\r\n\r\nExperienced Faculty\r\nThe faculty at GNC consists of seasoned professionals and academicians who bring real-world experience to the classroom. Their expertise and dedication ensure that students receive high-quality education and mentorship, enabling them to excel in their studies and future careers.\r\n\r\nState-of-the-Art Infrastructure\r\nGNC boasts modern infrastructure, including well-equipped laboratories, a comprehensive library, and comfortable study areas. These facilities create an optimal learning environment, enabling students to focus on their academic pursuits.\r\n\r\nPlacement Support\r\nThe college has a robust placement cell that connects students with top companies in the biotechnology sector. Regular workshops, training sessions, and career counseling are provided to help students develop the skills needed to succeed in the job market. GNC’s placement record is impressive, with many graduates securing positions in reputed organizations.\r\n\r\nHolistic Development\r\nGNC emphasizes holistic development by encouraging students to participate in extracurricular activities such as cultural events, sports, and community service. These activities help students develop essential life skills, including teamwork, leadership, and communication.\r\n\r\nStudent-Centric Approach\r\nThe college adopts a student-centric approach, offering personalized support and guidance to each student. Various scholarships and financial assistance programs are available to help students achieve their educational aspirations. The faculty and administration are always accessible, ensuring a supportive and nurturing environment.\r\n\r\nPositive Student Feedback\r\nStudents and alumni of GNC have consistently praised the college for its excellent faculty, supportive administration, and vibrant campus life. The strong sense of community and emphasis on personal growth make GNC a preferred choice for aspiring biotechnologists.<\/p>",
        "image": ".\/admin\/uploads\/6755ee078966a.webp",
        "show_toc": true
    },
    {
        "title": "Best B.Sc in Microbiology College in Dehradun: Guru Nanak College",
        "author": "GNC",
        "date": "2024-09-01",
        "content": "Nestled in the picturesque valleys of Dehradun, Guru Nanak College (GNC) stands as a beacon of excellence in the field of education. Among its distinguished programs, the Bachelor of Science in Microbiology (B.Sc. Microbiology) has gained a reputation for being one of the best in the region. Here’s a closer look at why GNC is considered the top choice for aspiring microbiologists:\r\n\r\nComprehensive Curriculum\r\nGuru Nanak College offers a well-structured B.Sc. Microbiology program that covers a broad spectrum of topics, including microbial genetics, immunology, virology, bacteriology, and industrial microbiology. The curriculum is designed to provide students with an in-depth understanding of microbial life and its applications in various industries such as healthcare, agriculture, and biotechnology.\r\n\r\nExperienced Faculty\r\nThe college boasts a team of highly qualified and experienced faculty members who are experts in their respective fields. Their dedication to teaching and research ensures that students receive a quality education, combining theoretical knowledge with practical skills. The faculty members also mentor students, guiding them through their academic journey and beyond.\r\n\r\nState-of-the-Art Infrastructure\r\nGNC provides modern infrastructure to support the learning process. The campus is equipped with advanced laboratories that offer hands-on experience with the latest tools and technologies in microbiology. Additionally, the comprehensive library and comfortable study areas create a conducive environment for research and learning.\r\n\r\nResearch Opportunities\r\nResearch is a significant focus at Guru Nanak College. Students are encouraged to engage in research projects, often collaborating with faculty on innovative studies that contribute to the field of microbiology. These opportunities not only enhance their learning experience but also prepare them for advanced studies and professional careers.\r\n\r\nPlacement Support\r\nThe college has a robust placement cell that connects students with leading companies and research institutions. Regular workshops, training sessions, and career counseling help students develop the skills needed to excel in the job market. GNC's strong industry connections ensure that graduates are well-placed in reputable organizations.\r\n\r\nHolistic Development\r\nGuru Nanak College emphasizes the holistic development of its students. Extracurricular activities, including cultural events, sports, and community service, are integral parts of campus life. These activities help students develop essential life skills such as leadership, teamwork, and communication.\r\n\r\nStudent-Centric Approach\r\nThe student-centric approach at GNC ensures personalized attention and support for each student. Various scholarships and financial assistance programs are available to help students achieve their educational goals. The faculty and administration are always accessible, ensuring a nurturing and supportive environment.\r\n\r\nPositive Student Feedback\r\nStudents and alumni of GNC consistently praise the college for its excellent faculty, supportive administration, and vibrant campus life. The strong sense of community and emphasis on personal growth make GNC a preferred choice for aspiring microbiologists",
        "image": ".\/admin\/uploads\/6755ef592f29c.webp"
    },
    {
        "title": "Best B.Sc in Food Technology College in Dehradun: Guru Nanak College",
        "author": "GNC",
        "date": "2024-09-02",
        "content": "Dehradun, known for its scenic beauty and educational excellence, is home to Guru Nanak College (GNC), which stands out as one of the top choices for pursuing a Bachelor of Science in Food Technology (B.Sc. Food Technology). Here’s why GNC is a leading contender:\r\n\r\nComprehensive Curriculum\r\nGuru Nanak College offers a well-rounded B.Sc. Food Technology program that covers essential subjects such as food science, food processing, quality control, and food safety. The curriculum is designed to provide students with a strong foundation in food technology, preparing them for various roles in the food industry.\r\n\r\nExperienced Faculty\r\nThe faculty at GNC consists of seasoned professionals and academicians who bring real-world experience to the classroom. Their expertise and dedication ensure that students receive high-quality education and mentorship, enabling them to excel in their studies and future careers.\r\n\r\nState-of-the-Art Infrastructure\r\nGNC boasts modern infrastructure, including well-equipped laboratories, a comprehensive library, and comfortable study areas. These facilities create an optimal learning environment, enabling students to focus on their academic pursuits.\r\n\r\nResearch Opportunities\r\nResearch is a significant focus at Guru Nanak College. Students are encouraged to engage in research projects, often collaborating with faculty on innovative studies that contribute to the field of food technology. These opportunities not only enhance their learning experience but also prepare them for advanced studies and professional careers.\r\n\r\nPlacement Support\r\nThe college has a robust placement cell that connects students with top companies in the food industry. Regular workshops, training sessions, and career counseling are provided to help students develop the skills needed to succeed in the job market. GNC’s placement record is impressive, with many graduates securing positions in reputed organizations.\r\n\r\nHolistic Development\r\nGNC emphasizes holistic development by encouraging students to participate in extracurricular activities such as cultural events, sports, and community service. These activities help students develop essential life skills, including teamwork, leadership, and communication.\r\n\r\nStudent-Centric Approach\r\nThe college adopts a student-centric approach, offering personalized support and guidance to each student. Various scholarships and financial assistance programs are available to help students achieve their educational goals. The faculty and administration are always accessible, ensuring a supportive and nurturing environment.\r\n\r\nPositive Student Feedback\r\nStudents and alumni of GNC consistently praise the college for its excellent faculty, supportive administration, and vibrant campus life. The strong sense of community and emphasis on personal growth make GNC a preferred choice for aspiring food technologists.",
        "image": ".\/admin\/uploads\/6755f23ff24e4.webp"
    },
    {
        "title": "Why Choose Guru Nanak College Dehradun for Higher Studies?",
        "author": "GNC",
        "date": "2024-09-01",
        "content": "Choosing the right college for higher studies is a pivotal decision that can shape your future. Among the myriad of options available, Guru Nanak College (GNC) in Dehradun stands out as an exceptional choice for students seeking a well-rounded and enriching educational experience. Here’s why GNC should be at the top of your list:\r\n\r\nComprehensive Academic Programs\r\nGuru Nanak College offers a diverse range of programs designed to cater to various interests and career goals. Whether you are looking to pursue a degree in science, technology, healthcare, management, or humanities, GNC has a robust curriculum tailored to meet industry standards. Some of the popular programs include BBA, BCA, B.Sc. in Biotechnology, Food Technology, and Microbiology, among others.\r\n\r\nExperienced Faculty\r\nAt GNC, the faculty members are not just educators but mentors who bring a wealth of knowledge and real-world experience to the classroom. Their dedication to teaching and research ensures that students receive a quality education that prepares them for successful careers. The faculty's expertise and commitment to student development create an environment conducive to learning and growth.\r\n\r\nState-of-the-Art Infrastructure\r\nGNC boasts modern infrastructure that enhances the overall learning experience. The campus is equipped with advanced laboratories, a comprehensive library, and comfortable study areas. These facilities support both theoretical and practical learning, ensuring students have access to the latest tools and technologies in their field of study.\r\n\r\nResearch Opportunities\r\nResearch is a cornerstone of the academic experience at Guru Nanak College. Students are encouraged to engage in research projects, often collaborating with faculty on innovative studies. These opportunities not only deepen their understanding of the subject matter but also prepare them for advanced studies and professional careers.\r\n\r\nStrong Industry Connections\r\nOne of the standout features of GNC is its strong industry connections. The college has established partnerships with leading companies and organizations, providing students with ample opportunities for internships, placements, and industry exposure. The robust placement cell works tirelessly to connect students with top employers, ensuring high placement rates.\r\n\r\nHolistic Development\r\nGNC believes in the holistic development of its students. Beyond academics, the college encourages participation in extracurricular activities such as cultural events, sports, and community service. These activities help students develop essential life skills, including leadership, teamwork, and communication, which are crucial for personal and professional success.\r\n\r\nStudent-Centric Approach\r\nThe student-centric approach at Guru Nanak College ensures personalized attention and support for each student. Various scholarships and financial assistance programs are available to help students achieve their educational goals. The faculty and administration are always accessible, providing a supportive and nurturing environment that fosters academic and personal growth.\r\n\r\nVibrant Campus Life\r\nCampus life at GNC is vibrant and dynamic, with a wide range of activities and events that cater to diverse interests. From cultural festivals and sports competitions to seminars and workshops, there is always something happening on campus. This lively environment helps students build lasting friendships and create unforgettable memories.\r\n\r\nPositive Student Feedback\r\nThe positive feedback from students and alumni speaks volumes about the quality of education and the overall experience at Guru Nanak College. Many students have shared their stories of personal and academic growth, highlighting the supportive community and the opportunities provided by the college.\r\n\r\nLocation Advantage\r\nSituated in the serene and beautiful city of Dehradun, GNC offers a peaceful and inspiring environment for learning. The city's natural beauty and pleasant climate make it an ideal place for higher education, allowing students to focus on their studies while enjoying the surroundings.",
        "image": ".\/admin\/uploads\/6755f3065fcbe.webp"
    },
    {
        "title": "Best B.Sc in Agriculture College in Dehradun: Guru Nanak College",
        "author": "GNC",
        "date": "2024-09-01",
        "content": "Dehradun, a city renowned for its educational excellence and scenic beauty, is home to Guru Nanak College (GNC), which stands out as one of the premier institutions for pursuing a Bachelor of Science in Agriculture (B.Sc. Agriculture). Here’s why GNC is considered the top choice for aspiring agricultural scientists and professionals:\r\n\r\nComprehensive Curriculum\r\nGuru Nanak College offers a robust B.Sc. Agriculture program that covers a wide range of topics crucial for a successful career in agriculture. The curriculum includes subjects such as agronomy, soil science, horticulture, plant pathology, agricultural economics, and agricultural engineering. This diverse curriculum ensures that students gain a well-rounded understanding of agricultural science and its applications.\r\n\r\nExperienced Faculty\r\nThe faculty at GNC comprises experienced professionals and academicians who are experts in their respective fields. Their dedication to teaching and research ensures that students receive high-quality education and mentorship. The faculty members are committed to guiding students through their academic journey, providing both theoretical knowledge and practical skills.\r\n\r\nState-of-the-Art Infrastructure\r\nGNC is equipped with modern infrastructure that enhances the learning experience. The campus features well-maintained agricultural fields, advanced laboratories, a comprehensive library, and comfortable study areas. These facilities provide students with hands-on experience and access to the latest tools and technologies in agriculture.\r\n\r\nResearch Opportunities\r\nResearch is a significant focus at Guru Nanak College. Students are encouraged to engage in research projects, often collaborating with faculty on innovative studies that contribute to the field of agriculture. These research opportunities not only enhance their learning experience but also prepare them for advanced studies and professional careers.\r\n\r\nIndustry Connections\r\nGNC has established strong connections with various agricultural industries and organizations. These partnerships provide students with valuable opportunities for internships, placements, and industry exposure. The college’s placement cell works tirelessly to ensure that students are well-prepared for the job market, connecting them with top employers in the agricultural sector.\r\n\r\nHolistic Development\r\nGuru Nanak College emphasizes the holistic development of its students. Beyond academics, the college encourages participation in extracurricular activities such as cultural events, sports, and community service. These activities help students develop essential life skills, including leadership, teamwork, and communication, which are crucial for personal and professional success.\r\n\r\nStudent-Centric Approach\r\nThe student-centric approach at GNC ensures personalized attention and support for each student. Various scholarships and financial assistance programs are available to help students achieve their educational goals. The faculty and administration are always accessible, providing a supportive and nurturing environment that fosters academic and personal growth.\r\n\r\nVibrant Campus Life\r\nCampus life at GNC is vibrant and enriching, with a wide range of activities and events that cater to diverse interests. From cultural festivals and sports competitions to seminars and workshops, there is always something happening on campus. This lively environment helps students build lasting friendships and create unforgettable memories.\r\n\r\nPositive Student Feedback\r\nStudents and alumni of GNC consistently praise the college for its excellent faculty, supportive administration, and dynamic campus life. The positive testimonials reflect the strong sense of community and emphasis on personal and academic growth.\r\n\r\nLocation Advantage\r\nSituated in the serene and beautiful city of Dehradun, GNC offers a peaceful and inspiring environment for learning. The city's natural beauty and pleasant climate make it an ideal place for higher education, allowing students to focus on their studies while enjoying the surroundings.",
        "image": ".\/admin\/uploads\/6755f4132e979.webp"
    },
    {
        "title": "Best B.Sc in Forestry College in Dehradun: Guru Nanak College",
        "author": "GNC",
        "date": "2024-12-09 01:04:27",
        "content": "Best B.Sc in Forestry College in Dehradun: Guru Nanak College\r\nDehradun, known for its lush green landscapes and educational excellence, is home to Guru Nanak College (GNC), which stands out as one of the premier institutions for pursuing a Bachelor of Science in Forestry (B.Sc. Forestry). Here’s why GNC is considered the top choice for aspiring foresters:\r\n\r\nComprehensive Curriculum\r\nGuru Nanak College offers a robust B.Sc. Forestry program that covers a wide range of topics crucial for a successful career in forestry. The curriculum includes subjects such as forest ecology, silviculture, forest management, environmental science, and conservation biology. This diverse curriculum ensures that students gain a well-rounded understanding of forestry and its applications.\r\n\r\nExperienced Faculty\r\nThe faculty at GNC consists of seasoned professionals and academicians who bring real-world experience to the classroom. Their dedication to teaching and research ensures that students receive high-quality education and mentorship. The faculty members are committed to guiding students through their academic journey, providing both theoretical knowledge and practical skills.\r\n\r\nState-of-the-Art Infrastructure\r\nGNC boasts modern infrastructure that enhances the overall learning experience. The campus features well-maintained forest areas, advanced laboratories, a comprehensive library, and comfortable study areas. These facilities provide students with hands-on experience and access to the latest tools and technologies in forestry.\r\n\r\nResearch Opportunities\r\nResearch is a significant focus at Guru Nanak College. Students are encouraged to engage in research projects, often collaborating with faculty on innovative studies that contribute to the field of forestry. These opportunities not only enhance their learning experience but also prepare them for advanced studies and professional careers.\r\n\r\nIndustry Connections\r\nGNC has established strong connections with various forestry industries and organizations. These partnerships provide students with valuable opportunities for internships, placements, and industry exposure. The college’s placement cell works tirelessly to ensure that students are well-prepared for the job market, connecting them with top employers in the forestry sector.\r\n\r\nHolistic Development\r\nGuru Nanak College emphasizes the holistic development of its students. Beyond academics, the college encourages participation in extracurricular activities such as cultural events, sports, and community service. These activities help students develop essential life skills, including leadership, teamwork, and communication, which are crucial for personal and professional success.\r\n\r\nStudent-Centric Approach\r\nThe college adopts a student-centric approach, offering personalized support and guidance to each student. Various scholarships and financial assistance programs are available to help students achieve their educational goals. The faculty and administration are always accessible, providing a supportive and nurturing environment that fosters academic and personal growth.\r\n\r\nVibrant Campus Life\r\nCampus life at GNC is vibrant and enriching, with a wide range of activities and events that cater to diverse interests. From cultural festivals and sports competitions to seminars and workshops, there is always something happening on campus. This lively environment helps students build lasting friendships and create unforgettable memories.\r\n\r\nPositive Student Feedback\r\nStudents and alumni of GNC consistently praise the college for its excellent faculty, supportive administration, and dynamic campus life. The positive testimonials reflect the strong sense of community and emphasis on personal and academic growth.\r\n\r\nLocation Advantage\r\nSituated in the serene and beautiful city of Dehradun, GNC offers a peaceful and inspiring environment for learning. The city's natural beauty and pleasant climate make it an ideal place for higher education, allowing students to focus on their studies while enjoying the surroundings.",
        "image": ".\/admin\/uploads\/6755f4c3c459d.webp"
    },
    {
        "title": "Best M.Sc in Horticulture College in Dehradun: Guru Nanak College",
        "author": "GNC",
        "date": "2024-12-09 01:07:44",
        "content": "Best M.Sc in Horticulture College in Dehradun: Guru Nanak College\r\nDehradun, known for its lush green landscapes and educational excellence, is home to Guru Nanak College (GNC), which stands out as one of the premier institutions for pursuing a Master of Science in Horticulture (M.Sc. Horticulture). Here’s why GNC is considered the top choice for aspiring horticulturists:\r\n\r\nComprehensive Curriculum\r\nGuru Nanak College offers a robust M.Sc. Horticulture program that covers a wide range of topics crucial for a successful career in horticulture. The curriculum includes subjects such as plant physiology, plant breeding, landscape horticulture, post-harvest technology, and pest management. This diverse curriculum ensures that students gain a well-rounded understanding of horticulture and its applications.\r\n\r\nExperienced Faculty\r\nThe faculty at GNC consists of seasoned professionals and academicians who bring real-world experience to the classroom. Their dedication to teaching and research ensures that students receive high-quality education and mentorship. The faculty members are committed to guiding students through their academic journey, providing both theoretical knowledge and practical skills.\r\n\r\nState-of-the-Art Infrastructure\r\nGNC boasts modern infrastructure that enhances the overall learning experience. The campus features well-maintained horticultural gardens, advanced laboratories, a comprehensive library, and comfortable study areas. These facilities provide students with hands-on experience and access to the latest tools and technologies in horticulture.\r\n\r\nResearch Opportunities\r\nResearch is a significant focus at Guru Nanak College. Students are encouraged to engage in research projects, often collaborating with faculty on innovative studies that contribute to the field of horticulture. These opportunities not only enhance their learning experience but also prepare them for advanced studies and professional careers.\r\n\r\nIndustry Connections\r\nGNC has established strong connections with various horticultural industries and organizations. These partnerships provide students with valuable opportunities for internships, placements, and industry exposure. The college’s placement cell works tirelessly to ensure that students are well-prepared for the job market, connecting them with top employers in the horticulture sector.\r\n\r\nHolistic Development\r\nGuru Nanak College emphasizes the holistic development of its students. Beyond academics, the college encourages participation in extracurricular activities such as cultural events, sports, and community service. These activities help students develop essential life skills, including leadership, teamwork, and communication, which are crucial for personal and professional success.\r\n\r\nStudent-Centric Approach\r\nThe college adopts a student-centric approach, offering personalized support and guidance to each student. Various scholarships and financial assistance programs are available to help students achieve their educational goals. The faculty and administration are always accessible, providing a supportive and nurturing environment that fosters academic and personal growth.\r\n\r\nVibrant Campus Life\r\nCampus life at GNC is vibrant and enriching, with a wide range of activities and events that cater to diverse interests. From cultural festivals and sports competitions to seminars and workshops, there is always something happening on campus. This lively environment helps students build lasting friendships and create unforgettable memories.\r\n\r\nPositive Student Feedback\r\nStudents and alumni of GNC consistently praise the college for its excellent faculty, supportive administration, and dynamic campus life. The positive testimonials reflect the strong sense of community and emphasis on personal and academic growth.\r\n\r\nLocation Advantage\r\nSituated in the serene and beautiful city of Dehradun, GNC offers a peaceful and inspiring environment for learning. The city's natural beauty and pleasant climate make it an ideal place for higher education, allowing students to focus on their studies while enjoying the surroundings.",
        "image": ".\/admin\/uploads\/6755f588ce2a4.webp"
    },
    {
        "title": "Guru Nanak College",
        "author": "Siddharth Sharma",
        "date": "2025-02-05",
        "content": "<h2>About GNC Placements<\/h2><h3>Getting You Industry Ready With The Most Leading Careers<\/h3><p>After securing admission to Guru Nanak College, students step into a world of academic excellence, professional growth, and unmatched career opportunities. The college is dedicated to bridging the gap between education and industry by providing students with exposure to top-tier placement prospects and career development programs. With a strong focus on industry collaborations, hands-on training, and strategically designed academic initiatives, Guru Nanak College ensures that every student is well-equipped with the skills, knowledge, and confidence required to excel in their chosen fields.<\/p><p>The institution’s dedicated placement cell actively engages with leading companies, conducts career counseling sessions, and organizes skill enhancement workshops, ensuring students are well-prepared for the dynamic job market. From internships with reputed organizations to full-time placements with milestone salary packages, Guru Nanak College empowers its students to achieve remarkable career success. With a commitment to holistic development, the college not only fosters technical expertise but also nurtures leadership qualities, problem-solving skills, and a professional mindset, making its graduates highly sought after by top employers worldwide.<\/p><ol><li>Guru Nanak College's consistent track record of successful placements speaks volumes about its commitment to student success. Year after year, graduates secure coveted positions in a diverse range of industries, from IT and finance to consulting and manufacturing. The college boasts strong relationships with industry giants, resulting in a steady stream of recruitment drives and placement opportunities. Beyond simply facilitating placements, the college focuses on matching students with roles that align with their individual skills and career aspirations.<\/li><li>The Bachelor of Pharmacy (B.Pharm) is a fundamental undergraduate degree for those interested in the pharmaceutical industry. This course, typically spanning four years, provides comprehensive education in the science and practice of pharmacy. It covers a range of subjects including pharmaceutical chemistry, pharmacology, pharmaceutics, and pharmacognosy.<\/li><\/ol><p><br><\/p><p><br><\/p>",
        "image": ".\/admin\/uploads\/67b5837259603.png"
    },
    {
        "title": "Best MPH College in Dehradun, Uttarakhand – Guru Nanak College",
        "author": "GNC Dehradun",
        "date": "2025-06-11",
        "content": "<h3>Best MPH College in Dehradun, Uttarakhand &ndash; Guru Nanak College<\/h3>\r\n<p>&nbsp;<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>Are you aspiring to pursue a Master of Public Health (MPH) from a reputed institution in Uttarakhand? Look no further.<strong> Guru Nanak College, Dehradun<\/strong>, stands out as one of the <strong>best MPH colleges in Dehradun<\/strong>, offering a future-focused program designed to shape the next generation of public health professionals.<\/p>\r\n<p>&nbsp;<\/p>\r\n<h2>Why Choose MPH at Guru Nanak College?<\/h2>\r\n<p>&nbsp;<\/p>\r\n<p><strong>1. Academic Excellence<\/strong><\/p>\r\n<p>&nbsp;<\/p>\r\n<p>Guru Nanak College is renowned for its strong academic foundation and dedicated faculty members who bring real-world public health experience into the classroom. The MPH program is designed according to global standards, incorporating both theoretical knowledge and hands-on training.<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>2. Industry-Relevant Curriculum<\/strong><\/p>\r\n<p>&nbsp;<\/p>\r\n<p>The MPH program at Guru Nanak College covers key areas such as:<\/p>\r\n<ul>\r\n<li>Epidemiology<\/li>\r\n<li>Biostatistics<\/li>\r\n<li>Environmental Health<\/li>\r\n<li>Health Policy &amp; Management<\/li>\r\n<li>Social &amp; Behavioural Sciences<\/li>\r\n<\/ul>\r\n<p>&nbsp;<\/p>\r\n<p>This multidisciplinary approach ensures that students are well-equipped to tackle current and emerging public health challenges.<\/p>\r\n<p><strong>3. Practical Exposure<\/strong><\/p>\r\n<p>&nbsp;<\/p>\r\n<p>The college emphasizes<strong> community-based learning<\/strong>, fieldwork, internships, and research projects.Students actively participate in health awareness drives, and rural health initiatives, and collaborate with NGOs and government health departments.<\/p>\r\n<p><strong>4. Experienced Faculty<\/strong><\/p>\r\n<p>&nbsp;<\/p>\r\n<p>The faculty includes qualified doctors, public health experts, and researchers with vast experience in the field. Their mentorship not only enhances academic understanding but also guides students in building successful careers.<\/p>\r\n<p><strong>5. State-of-the-Art Infrastructure<\/strong><\/p>\r\n<p>&nbsp;<\/p>\r\n<p>Guru Nanak College provides a modern learning environment with:<\/p>\r\n<ul>\r\n<li>Smart classrooms<\/li>\r\n<li>Well-equipped laboratories<\/li>\r\n<li>Digital libraries<\/li>\r\n<li>Seminar halls<\/li>\r\n<li>Hostel &amp; transport facilities<\/li>\r\n<\/ul>\r\n<p>&nbsp;<\/p>\r\n<p><strong>6. Career Opportunities<\/strong><\/p>\r\n<p>Graduates from the MPH program at Guru Nanak College are placed in:<\/p>\r\n<ul>\r\n<li>Government health departments<\/li>\r\n<li>NGOs and international health organizations<\/li>\r\n<li>Hospitals and healthcare consultancies<\/li>\r\n<li>Research institutions<\/li>\r\n<li>Health policy &amp; planning departments<\/li>\r\n<\/ul>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Ideal Location &ndash; Heart of Dehradun<\/strong><\/p>\r\n<p>Situated in the serene city of <strong>Dehradun<\/strong>, Uttarakhand, Guru Nanak College offers a peaceful and focused academic environment. The city's growing healthcare ecosystem provides ample opportunities for exposure and growth in the public health domain.<\/p>\r\n<p><strong>Admission Open &ndash; Apply Today!<\/strong><\/p>\r\n<p>&nbsp;<\/p>\r\n<p>If you&rsquo;re passionate about making a real difference in the world of public health, Guru Nanak College, Dehradun, is your ideal destination. Admissions for the MPH program are now open. Don&rsquo;t miss the chance to join one of the <strong>best MPH colleges in Uttarakhand.<\/strong><\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong> For more details, visit: <\/strong><\/p>\r\n<p><a href=\"https:\/\/gnc.edu.in\/master-of-public-health?utm_source=Website&amp;utm_medium=Online&amp;utm_campaign=GNC-Website\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Apply Now or Learn More<\/strong><\/a><\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Call\/WhatsApp:<\/strong><\/p>\r\n<p>+91-7300900900<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Email: <\/strong><\/p>\r\n<p>admission@gnc.edu.in<\/p>",
        "image": ".\/admin\/uploads\/mph.webp",
        "show_toc": true,
        "slug": "best-mph-college-in-dehradun-uttarakhand-guru-nanak-college"
    },
    {
        "title": "Guru Nanak college jhajra",
        "author": "siddharth",
        "date": "2025-06-21",
        "content": "<h2><strong>1. Doon University, Dehradun<\/strong><\/h2>\r\n<p>Location: Kedarpur, Dehradun<\/p>\r\n<p>Accreditation: State Public University, UGC Recognized<\/p>\r\n<p>Eligibility: 10+2 with at least 50% marks<\/p>\r\n<p>Entrance Test: Doon University Entrance Test (DUET)<\/p>\r\n<p>Annual Fees: ₹40,000 &ndash; ₹50,000<\/p>\r\n<p>Placement Highlights:<\/p>\r\n<p>&bull; Average Package: ₹3.5 LPA<\/p>\r\n<p>&bull; Sectors: NGOs, public administration, research &amp; education<\/p>\r\n<p>Why Choose:<\/p>\r\n<p>Doon University offers a research-oriented, government-backed BBA program with affordable fees. It is suitable for students who prefer an academic and public serviceoriented career path.<\/p>\r\n<h2><strong>2. Guru Nanak College, Dehradun<\/strong><\/h2>\r\n<p>Location: Race Course Road, Dehradun (Central location)<\/p>\r\n<p>Affiliation: Sri Dev Suman Uttarakhand University (SDSU)<\/p>\r\n<p>Eligibility: 10+2 with minimum 45% marks (any stream)<\/p>\r\n<p>Entrance Test: No entrance test required; admission based on merit<\/p>\r\n<p>Annual Fees: ₹32,000 Placement Highlights:<\/p>\r\n<p>&bull; Highest Package: ₹4.2 LPA<\/p>\r\n<p>&bull; Average Package: ₹2.5 LPA<\/p>\r\n<p>&bull; Top recruiters: Local businesses, edtech startups, marketing firms<\/p>\r\n<p>Why Choose:<\/p>\r\n<p>Guru Nanak College is one of the fastest-growing BBA colleges in Dehradun. With a curriculum focused on practical learning, entrepreneurial skills, and industry exposure, it combines affordability with quality education. The college&rsquo;s central location and studentcentric approach make it a preferred choice for budget-conscious students seeking realworld success. Apply or learn more: https:\/\/gnc.edu.in\/Best-BBA-College-in-Dehradun-Uttarakahnd<\/p>\r\n<h2><strong>3. Graphic Era University <\/strong><\/h2>\r\n<p>Location: Clement Town, Dehradun<\/p>\r\n<p>Accreditation: NAAC A+, UGC-recognized, AICTE approved<\/p>\r\n<p>Eligibility: 10+2 with minimum 50% marks<\/p>\r\n<p>Entrance Test: GEJET or merit-based<\/p>\r\n<p>Annual Fees: ₹1.42 Lakhs<\/p>\r\n<p>Placement Highlights:<\/p>\r\n<p>&bull; Average Package: ₹4.5 LPA<\/p>\r\n<p>&bull; Recruiters: Wipro, Infosys, TCS, Deloitte<\/p>\r\n<p>Why Choose:<\/p>\r\n<p>Graphic Era is a top private university in Dehradun known for its strong industry tie-ups and global collaborations. The BBA program offers specialization options and a modern teaching environment.<\/p>\r\n<h2><strong>4. DIT University <\/strong><\/h2>\r\n<p>Location: Mussoorie Diversion Road, Dehradun<\/p>\r\n<p>Accreditation: UGC Approved, NAAC Accredited<\/p>\r\n<p>Eligibility: 10+2 with minimum 50% marks<\/p>\r\n<p>Entrance Test: Merit-based followed by a personal interview<\/p>\r\n<p>Annual Fees: ₹1.10 Lakhs<\/p>\r\n<p>Placement Highlights:<\/p>\r\n<p>&bull; Average Package: ₹3.8 LPA<\/p>\r\n<p>&bull; Recruiters: HDFC Bank, Tommy Hilfiger, Byju&rsquo;s<\/p>\r\n<p>Why Choose: DIT University blends business education with emerging technologies. Its BBA program encourages innovation, digital fluency, and leadership through case studies and industry internships.<\/p>\r\n<h2><strong>5. UPES Dehradun<\/strong><\/h2>\r\n<p>Location: Bidholi &amp; Kandoli Campuses, Dehradun<\/p>\r\n<p>Accreditation: NAAC A, UGC recognized, AIU member<\/p>\r\n<p>Eligibility: 10+2 with at least 50% marks<\/p>\r\n<p>Entrance Test: CUET \/ UPESEAT \/ SAT \/ Board Merit<\/p>\r\n<p>Annual Fees: ₹2.52 Lakhs<\/p>\r\n<p>Placement Highlights:<\/p>\r\n<p>&bull; Highest Package: ₹7.5 LPA<\/p>\r\n<p>&bull; Average Package: ₹4.2 LPA<\/p>\r\n<p>&bull; Recruiters: Accenture, EY, Amazon, KPMG<\/p>\r\n<p>Why Choose:<\/p>\r\n<p>UPES offers domain-specific BBA programs in logistics, digital business, international business, and more. With strong infrastructure and global links, it is a good fit for students aiming for international careers.&nbsp;<\/p>\r\n<h2><strong>6. Summary: Best BBA Colleges in Dehradun &ndash; Quick Comparison<\/strong><\/h2>\r\n<p>College | Annual Fees |Eligibility |Average Placement |Entrance Test<\/p>\r\n<p>Doon University | ₹45,000 | 10+2 with 50% | ₹3.5 LPA |DUET<\/p>",
        "image": "",
        "show_toc": true,
        "slug": "guru-nanak-college-jhajra"
    },
    {
        "title": "Top 5 BBA Colleges in Dehradun in 2025 – Courses, Fees, Eligibility and Placements",
        "author": "GNC Dehradun",
        "date": "2025-06-21",
        "content": "<h2 id=\"heading-0\"><strong>1. Doon University, Dehradun<\/strong><\/h2>\r\n<p>Location: Kedarpur, Dehradun<\/p>\r\n<p>Accreditation: State Public University, UGC Recognized<\/p>\r\n<p>Eligibility: 10+2 with at least 50% marks<\/p>\r\n<p>Entrance Test: Doon University Entrance Test (DUET)<\/p>\r\n<p>Annual Fees: ₹40,000 &ndash; ₹50,000<\/p>\r\n<p>Placement Highlights:<\/p>\r\n<p>&bull; Average Package: ₹3.5 LPA<\/p>\r\n<p>&bull; Sectors: NGOs, public administration, research &amp; education<\/p>\r\n<p>Why Choose:<\/p>\r\n<p>Doon University offers a research-oriented, government-backed BBA program with affordable fees. It is suitable for students who prefer an academic and public serviceoriented career path.<\/p>\r\n<h2 id=\"heading-1\"><strong>2. Guru Nanak College, Dehradun<\/strong><\/h2>\r\n<p>Location: Race Course Road, Dehradun (Central location)<\/p>\r\n<p>Affiliation: Sri Dev Suman Uttarakhand University (SDSU)<\/p>\r\n<p>Eligibility: 10+2 with minimum 45% marks (any stream)<\/p>\r\n<p>Entrance Test: No entrance test required; admission based on merit<\/p>\r\n<p>Annual Fees: ₹32,000 Placement Highlights:<\/p>\r\n<p>&bull; Highest Package: ₹4.2 LPA<\/p>\r\n<p>&bull; Average Package: ₹2.5 LPA<\/p>\r\n<p>&bull; Top recruiters: Local businesses, edtech startups, marketing firms<\/p>\r\n<p>Why Choose:<\/p>\r\n<p>Guru Nanak College is one of the fastest-growing BBA colleges in Dehradun. With a curriculum focused on practical learning, entrepreneurial skills, and industry exposure, it combines affordability with quality education. The college&rsquo;s central location and studentcentric approach make it a preferred choice for budget-conscious students seeking realworld success. Apply or learn more: https:\/\/gnc.edu.in\/Best-BBA-College-in-Dehradun-Uttarakahnd<\/p>\r\n<h2 id=\"heading-2\"><strong>3. Graphic Era University<\/strong><\/h2>\r\n<p>Location: Clement Town, Dehradun<\/p>\r\n<p>Accreditation: NAAC A+, UGC-recognized, AICTE approved<\/p>\r\n<p>Eligibility: 10+2 with minimum 50% marks<\/p>\r\n<p>Entrance Test: GEJET or merit-based<\/p>\r\n<p>Annual Fees: ₹1.42 Lakhs<\/p>\r\n<p>Placement Highlights:<\/p>\r\n<p>&bull; Average Package: ₹4.5 LPA<\/p>\r\n<p>&bull; Recruiters: Wipro, Infosys, TCS, Deloitte<\/p>\r\n<p>Why Choose:<\/p>\r\n<p>Graphic Era is a top private university in Dehradun known for its strong industry tie-ups and global collaborations. The BBA program offers specialization options and a modern teaching environment.<\/p>\r\n<h2 id=\"heading-3\"><strong>4. DIT University<\/strong><\/h2>\r\n<p>Location: Mussoorie Diversion Road, Dehradun<\/p>\r\n<p>Accreditation: UGC Approved, NAAC Accredited<\/p>\r\n<p>Eligibility: 10+2 with minimum 50% marks<\/p>\r\n<p>Entrance Test: Merit-based followed by a personal interview<\/p>\r\n<p>Annual Fees: ₹1.10 Lakhs<\/p>\r\n<p>Placement Highlights:<\/p>\r\n<p>&bull; Average Package: ₹3.8 LPA<\/p>\r\n<p>&bull; Recruiters: HDFC Bank, Tommy Hilfiger, Byju&rsquo;s<\/p>\r\n<p>Why Choose: DIT University blends business education with emerging technologies. Its BBA program encourages innovation, digital fluency, and leadership through case studies and industry internships.<\/p>\r\n<h2 id=\"heading-4\"><strong>5. UPES Dehradun<\/strong><\/h2>\r\n<p>Location: Bidholi &amp; Kandoli Campuses, Dehradun<\/p>\r\n<p>Accreditation: NAAC A, UGC recognized, AIU member<\/p>\r\n<p>Eligibility: 10+2 with at least 50% marks<\/p>\r\n<p>Entrance Test: CUET \/ UPESEAT \/ SAT \/ Board Merit<\/p>\r\n<p>Annual Fees: ₹2.52 Lakhs<\/p>\r\n<p>Placement Highlights:<\/p>\r\n<p>&bull; Highest Package: ₹7.5 LPA<\/p>\r\n<p>&bull; Average Package: ₹4.2 LPA<\/p>\r\n<p>&bull; Recruiters: Accenture, EY, Amazon, KPMG<\/p>\r\n<p>Why Choose:<\/p>\r\n<p>UPES offers domain-specific BBA programs in logistics, digital business, international business, and more. With strong infrastructure and global links, it is a good fit for students aiming for international careers.&nbsp;<\/p>\r\n<h2 id=\"heading-5\"><strong>6. Summary: Best BBA Colleges in Dehradun &ndash; Quick Comparison<\/strong><\/h2>\r\n<table style=\"border-collapse: collapse; width: 100%; height: 117.6px;\" border=\"1\"><colgroup><col style=\"width: 20%;\"><col style=\"width: 20%;\"><col style=\"width: 20%;\"><col style=\"width: 20%;\"><col style=\"width: 20%;\"><\/colgroup>\r\n<tbody>\r\n<tr style=\"height: 19.6px;\">\r\n<td style=\"height: 19.6px;\">College<\/td>\r\n<td style=\"height: 19.6px;\">Annual Fees<\/td>\r\n<td style=\"height: 19.6px;\">Eligibility<\/td>\r\n<td style=\"height: 19.6px;\">Average Placement<\/td>\r\n<td style=\"height: 19.6px;\">Entrance Test<\/td>\r\n<\/tr>\r\n<tr style=\"height: 19.6px;\">\r\n<td style=\"height: 19.6px;\">Doon University<\/td>\r\n<td style=\"height: 19.6px;\">₹45,000<\/td>\r\n<td style=\"height: 19.6px;\">10+2 with 50%<\/td>\r\n<td style=\"height: 19.6px;\">₹3.5 LPA<\/td>\r\n<td style=\"height: 19.6px;\">DUET<\/td>\r\n<\/tr>\r\n<tr style=\"height: 19.6px;\">\r\n<td style=\"height: 19.6px;\">Guru Nanak College<\/td>\r\n<td style=\"height: 19.6px;\">₹32,000<\/td>\r\n<td style=\"height: 19.6px;\">10+2 with 45%<\/td>\r\n<td style=\"height: 19.6px;\">₹2.5 LPA<\/td>\r\n<td style=\"height: 19.6px;\">Merit-Based<\/td>\r\n<\/tr>\r\n<tr style=\"height: 19.6px;\">\r\n<td style=\"height: 19.6px;\">Graphic Era University<\/td>\r\n<td style=\"height: 19.6px;\">₹1.42 Lakhs<\/td>\r\n<td style=\"height: 19.6px;\">10+2 with 50%<\/td>\r\n<td style=\"height: 19.6px;\">₹4.5 LPA<\/td>\r\n<td style=\"height: 19.6px;\">GEJET (optional)<\/td>\r\n<\/tr>\r\n<tr style=\"height: 19.6px;\">\r\n<td style=\"height: 19.6px;\">DIT University<\/td>\r\n<td style=\"height: 19.6px;\">₹1.10 Lakhs<\/td>\r\n<td style=\"height: 19.6px;\">10+2 with 50%<\/td>\r\n<td style=\"height: 19.6px;\">₹3.8 LPA<\/td>\r\n<td style=\"height: 19.6px;\">Merit + Interview<\/td>\r\n<\/tr>\r\n<tr style=\"height: 19.6px;\">\r\n<td style=\"height: 19.6px;\">UPES<\/td>\r\n<td style=\"height: 19.6px;\">₹2.52 Lakhs<\/td>\r\n<td style=\"height: 19.6px;\">10+2 with 50%<\/td>\r\n<td style=\"height: 19.6px;\">₹4.2 LPA&nbsp;<\/td>\r\n<td style=\"height: 19.6px;\">CUET\/UPESEAT\/SAT<\/td>\r\n<\/tr>\r\n<\/tbody>\r\n<\/table>",
        "image": "",
        "show_toc": true,
        "slug": "top-5-bba-colleges-in-dehradun-in-2025-courses-fees-eligibility-and-placements"
    },
    {
        "title": "Testing by siddharth developer",
        "slug": "testing-by-siddharth-developer",
        "author": "Siddharth",
        "date": "2025-10-29",
        "content": "<section id=\"about-gnc\" class=\"about-section\">\r\n<div class=\"container\">\r\n<div class=\"about-content aos-init aos-animate\" data-aos=\"fade-up\" data-aos-duration=\"1000\">\r\n<h2 class=\"about-title\">About&nbsp;Guru Nanak College<\/h2>\r\n<h3 class=\"about-subtitle\">Best College in Uttarakhand, India<\/h3>\r\n<p class=\"about-text\">Guru Nanak College, situated in the serene and academically vibrant city of Dehradun, has established itself as a prestigious center of higher education since its inception under the aegis of NIMS, Dehradun in 2009. Renowned for its specialization in pharmacy education and paramedical studies, the college has rapidly emerged as a top Pharmaceutical and Paramedical College in the region. Despite its relatively short history, it has gained a reputation as one of the most prestigious Pharmacy Colleges in Dehradun.<\/p>\r\n<p class=\"about-text\">At Guru Nanak College, the ethos is deeply rooted in fostering the growth of the next generation of pharmaceutical professionals, paramedics, and nurses. This commitment extends beyond mere academic instruction; the college prides itself on instilling values of innovation, ethical practice, and academic excellence. It operates with a belief that education is a pivotal force in personal and societal advancement, a philosophy that resonates through its diverse course offerings.<\/p>\r\n<\/div>\r\n<div class=\"stats aos-init aos-animate\" data-aos=\"zoom-in\" data-aos-duration=\"1000\">\r\n<div class=\"stat-box\">\r\n<h3 class=\"counter\" data-target=\"100\">100<\/h3>\r\n<p>Companies<br>visited for Placements<\/p>\r\n<\/div>\r\n<div class=\"stat-box\">\r\n<h3 class=\"counter\" data-target=\"300\">300<\/h3>\r\n<p>Professionals successfully<br>working across the globe<\/p>\r\n<\/div>\r\n<div class=\"stat-box\">\r\n<h3 class=\"counter\" data-target=\"1.01\">1.01<\/h3>\r\n<p>Highest<br>Package Offered (CR)<\/p>\r\n<\/div>\r\n<div class=\"stat-box\">\r\n<h3 class=\"counter\" data-target=\"14\">14<\/h3>\r\n<p>Years of<br>Excellence<\/p>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/section>\r\n<section id=\"accreditations\">\r\n<div class=\"container\">\r\n<div class=\"row align-items-center\">\r\n<div class=\"col-md-6 text-center mb-4 mb-md-0\">\r\n<div id=\"accreditationCircle\" class=\"accreditation-circle expanded\"><\/div>\r\n<\/div>\r\n<div class=\"col-md-6\">\r\n<h2 class=\"mb-3 mt-5\">Approvals, Accreditation &amp; Memberships<\/h2>\r\n<p>The college proudly holds multiple approvals, accreditations, and memberships from renowned national bodies, reflecting its unwavering commitment to academic excellence, innovation, and holistic development. These recognitions validate the quality of our programs and ensure that they meet rigorous educational and professional standards.<\/p>\r\n<ul>\r\n<li>All India Council for Technical Education (AICTE)<\/li>\r\n<li>University Grants Commission (UGC)<\/li>\r\n<li>Ministry of Micro, Small and Medium Enterprises (MSME)<\/li>\r\n<li>Hemvati Nandan Bahuguna Garhwal University (HNBGU)<\/li>\r\n<li>Pharmacy Council of India (PCI)<\/li>\r\n<li>Uttarakhand Board of Technical Education, Roorkee (UBTER)<\/li>\r\n<li>Uttarakhand Technical University (UTU)<\/li>\r\n<li>The Indian Association of Physiotherapists (IAP)<\/li>\r\n<li>The Indian Nursing Council (INC)<\/li>\r\n<li>Sri Dev Suman Uttarakhand University (SDSUU)<\/li>\r\n<\/ul>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/section>",
        "image": ".\/admin\/uploads\/6901a98743c5f.png",
        "show_toc": true
    }
]